#include <iostream>
#include <time.h>

using namespace std;

/*
Сформировать массив структур, каждый элемент которого содержит следующие поля :

шифр подразделения, содержащий не более трёх символов(вводим);

план выпуска продукции по кварталам одного года в виде массива(вводим);

фактическое выполнение плана по кварталам одного года в виде массива(вводим);



Рассортировать массив структур следующим образом : сначала должна быть информация о тех подразделениях,
которые выполнили план во всех кварталах, затем о тех, кто выполнил план в трёх кварталах, и т.д.
*/


void main() {

}